Revit 2024 API
BuiltInFailures.SketchFailures.LinesOverlapPath3d Property
 Cannot have overlapping lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LinesOverlapPath3d { get; }
Visual Basic
Public Shared ReadOnly Property LinesOverlapPath3d As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LinesOverlapPath3d {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace